sargoliwork101-ui/cooler_app14050504/esp32_api/Cooler_ESP32_WROOM_API.ino
WebServer server(80);

// کد ثابت ریست کامل حافظه برد؛ در UI به کاربر نمایش داده نمی‌شود.
const char* FACTORY_RESET_CODE = "123456";
bool pendingFactoryReset = false;

void feedWatchdog();

// ESP32 در این نسخه هیچ HTML/CSS/JS تولید نمی‌کند؛ فقط API JSON ارائه می‌شود.

// ساختار هر سناریو
struct Scenario {
  bool active = false;   // وجود داشتن سناریو در لیست؛ حذف کردن این مقدار را false می‌کند
  bool enabled = false;  // فعال/غیرفعال بودن اجرای سناریو؛ با حذف کردن فرق دارد
  int startHour = 0;
  int startMinute = 0;
  int endHour = 0;
  int endMinute = 0;
  // بیت ۰=شنبه ... بیت ۶=جمعه؛ 127 یعنی هر روز هفته
  uint8_t weekdays = 0x7F;
};

Scenario scenarios[MAX_SCENARIOS];

// متغیرهای زمان داخلی برد
int currentHour = 0;
int currentMinute = 0;
int currentSecond = 0;
// تاریخ میلادی و روز هفته: ۰=شنبه ... ۶=جمعه
int currentYear = 2026, currentMonth = 1, currentDay = 1;
int currentWeekday = 3;
unsigned long lastTick = 0;

// وضعیت کنترل دستی رله (0 = خودکار/بر اساس سناریو، 1 = روشن دستی)
int manual_override = 0; 

// پرچم همگام‌سازی ساعت با گوشی
bool time_synchronized = false;

// --- وضعیت واقعی دریافت ساعت از اینترنت (NTP) در همین نوبت روشن بودن دستگاه ---
// نکته مهم: time_synchronized از روی فایل ذخیره‌شده (حتی سنکرون قدیمی با گوشی) در همان لحظه بوت لود می‌شود
// و همیشه true می‌ماند. اگر از همان متغیر برای فاصله‌ی تلاش مجدد NTP استفاده شود، در صورتی که ساعت قبلاً
// (چه با گوشی و چه از بوت قبلی) سنکرون بوده، برد فکر می‌کند NTP هم قبلاً موفق بوده و به‌جای هر ۱ دقیقه،
// هر ۱ ساعت یک‌بار تلاش می‌کند؛ در نتیجه با اینکه به مودم وصل است، ساعت واقعی اینترنت ممکن است تا یک ساعت
// دریافت نشود و کاربر فکر می‌کند "وصل شد ولی ساعت نگرفت". برای همین یک پرچم جداگانه فقط برای همین بوت داریم.
bool ntp_synced_this_boot = false;

// آیا تا به حال حداقل یک‌بار ساعت با موفقیت از اینترنت گرفته شده (برای نمایش در پنل)
bool ntpEverSucceeded = false;
// آخرین زمانِ مطلقِ دریافت موفق ساعت از اینترنت که باید حتی بعد از ریست هم باقی بماند.
bool ntpLastSuccessValid = false;
int ntpLastSuccessYear = 2026, ntpLastSuccessMonth = 1, ntpLastSuccessDay = 1;
int ntpLastSuccessHour = 0, ntpLastSuccessMinute = 0, ntpLastSuccessSecond = 0;
const char* NTP_META_FILE = "/ntp.json";

// زمان‌بندی داخلی تلاش NTP. این‌ها عمداً global هستند تا هنگام تغییر تنظیمات مودم/اینترنت
// بتوانیم تلاش بعدی را فوراً از نو برنامه‌ریزی کنیم.
unsigned long lastNtpCheckMillis = 0;
bool ntpFirstCheckPending = true;

// --- وضعیت دقیق اتصال STA (مودم اینترنت) برای نمایش سه‌حالته در پنل (نارنجی/سبز/قرمز) ---
// آیا از زمان روشن شدن دستگاه، حداقل یک‌بار به مودم اینترنت وصل شده؛ برای تشخیص «هنوز هیچ‌وقت وصل نشده»
// (حالت در حال اتصال، نارنجی) از «قبلاً وصل بوده و الان قطع شده» (حالت قطعی، قرمز).
bool staEverConnectedThisBoot = false;

// متغیرهای مدیریت ریستارت غیر بلاک کننده
unsigned long resetMillis = 0;
bool pendingReset = false;

// Rate limiting endpointهای وب: جلوگیری از اسپم لمس/درخواست و استهلاک فلش یا رله.
unsigned long lastToggleManualRequest = 0;
unsigned long lastSaveScenarioRequest = 0;
unsigned long lastSyncRequest = 0;
unsigned long lastSaveApRequest = 0;
unsigned long lastSaveStaRequest = 0;
unsigned long lastSaveProtectionRequest = 0;
unsigned long lastSaveApCycleRequest = 0;
unsigned long lastFactoryResetRequest = 0;
unsigned long lastStatusRequest = 0;

// ============ مدیریت ذخیره امن زمان (برای مقاومت در برابر نوسان برق) ============
// به‌جای یک فایل، از دو فایل به صورت چرخشی (Round-Robin) استفاده می‌شود.
// اگر برق درست وسط نوشتن یکی از فایل‌ها قطع شود، فایل دیگر همچنان سالم و قابل استفاده باقی می‌ماند.
const char* TIME_FILES[2] = {"/time0.txt", "/time1.txt"};
int timeFileSlot = 0;                 // فایلی که نوبت نوشتن در آن است
unsigned long timeSaveSeq = 0;        // شماره‌ی افزایشی برای تشخیص جدیدترین رکورد هنگام خواندن
unsigned long lastTimeSaveMillis = 0; // زمان آخرین ذخیره‌سازی دوره‌ای
// =================================================================================

// ============ آمار سوییچ و مدت‌کارکرد رله (برای پایش سلامت/عمر کمپرسور) ============
// همان تکنیک دو-فایلی چرخشی بالا برای مقاومت در برابر قطعی برق اینجا هم استفاده می‌شود.
unsigned long relaySwitchCount = 0;       // تعداد دفعاتی که کمپرسور واقعاً روشن شده (هر بار خاموش→روشن یک واحد)
unsigned long relayTotalOnSeconds = 0;    // مجموع ثانیه‌های روشن بودن که تا کنون به صورت قطعی ذخیره شده
unsigned long relayOnSinceMillis = 0;     // لحظه (millis) شروع دوره‌ی روشن بودن جاری؛ فقط وقتی relayCurrentlyOnForStats=true معتبر است
bool relayCurrentlyOnForStats = false;    // آیا هم‌اکنون یک دوره‌ی «روشن» در حال اندازه‌گیری است
int lastRelayStatState = -1;              // آخرین وضعیت منطقی رله که برای آمار ثبت شده (جدا از منطق اصلی سناریو/دستی)
const char* RELAY_STAT_FILES[2] = {"/relaystat0.txt", "/relaystat1.txt"};
int relayStatFileSlot = 0;
unsigned long relayStatSaveSeq = 0;
unsigned long lastRelayStatSaveMillis = 0; // زمان آخرین ذخیره‌سازی دوره‌ای پیشرفت مدت‌کارکرد جاری

// سقف‌های sanity برای جلوگیری از نمایش/ذخیره عددهای پرت در آمار موتور.
// اگر فایل آمار هنگام قطع برق/خرابی فلش مقدار غیرواقعی داشته باشد، هنگام خواندن رد می‌شود.
// همچنین اگر به هر دلیل زمان شروع دوره روشن بودن خراب شود، یک جهش بزرگ به مجموع کارکرد اضافه نمی‌شود.
const unsigned long MAX_RELAY_SWITCH_COUNT = 500000UL;
const unsigned long MAX_RELAY_ON_SECONDS   = 10UL * 365UL * 24UL * 60UL * 60UL; // ۱۰ سال کارکرد واقعی
const unsigned long MAX_RELAY_OPEN_PERIOD_SECONDS = (TIME_SAVE_INTERVAL / 1000UL) * 2UL + 120UL;
// =================================================================================

// تعریف توابع سیستم
void loadScenarios();
void saveScenarios();
void loadWiFiSettings();
void saveWiFiSettings();
void loadOverrideSetting();
void loadProtectionSettings();
void saveProtectionSettings();
void saveOverrideSetting();
void saveTimeSetting();
void loadTimeSetting();
bool readTimeFile(const char* path, int &h, int &m, int &s, int &sync, unsigned long &seq, int &y, int &mon, int &d, int &wd);
void advanceDate();
bool isLeapYear(int year);
void saveRelayStats();
void loadRelayStats();
bool readRelayStatFile(const char* path, unsigned long &sc, unsigned long &tos, unsigned long &seq);
unsigned long relayCurrentPeriodElapsedSeconds();
void addRelayOnSecondsSafely(unsigned long secondsToAdd);
void loadNtpSuccessInfo();
void saveNtpSuccessInfo();
void handleApiRoot();
void handleGetSettings();
void handleSaveScenario();
void handleSyncTime();
void handleGetStatus();
void handleToggleManual();
void handleSaveAP();
void handleSaveSTA();
void handleSaveProtection();
void handleSaveApCycle();
void handleFactoryReset();
bool allowRequest(unsigned long &lastRequest, unsigned long minIntervalMs);
void sendJsonMessage(int code, const char* status, const char* message);
void handleCorsOptions();
bool parseJsonBody(JsonDocument &doc);
String fnv1aChecksum(const String &data);
JsonVariantConst verifiedPayload(JsonDocument &doc, bool &ok);
void checkScenarios();
void updateClock();
void setRelay(bool state);
void applyApTxPower();
void setApRadioState(bool on);
void manageApCycle();
void setStaConnectionState(bool on);
void manageStaCycle();
void connectToInternetWiFi();
void tryNtpSync();
String encryptPassword(const char* password, size_t bufferSize);
void loadAndDecryptPassword(const char* savedValue, char* outputBuffer, size_t bufferSize);

// بررسی با تفاضل unsigned long برای سازگاری با سرریز millis().
// پاسخ 429 به مرورگر برمی‌گردد و هیچ تغییری در رله یا فایل‌ها انجام نمی‌شود.
bool allowRequest(unsigned long &lastRequest, unsigned long minIntervalMs) {
  unsigned long now = millis();
  if (lastRequest != 0 && (unsigned long)(now - lastRequest) < minIntervalMs) {
    sendJsonMessage(429, "error", "Too Many Requests");
    return false;
  }
  lastRequest = now;
  return true;
}

// ================== Watchdog مخصوص ESP32 ==================
// در نسخه ESP8266 از ESP.wdtEnable/ESP.wdtFeed استفاده می‌شد؛
// در ESP32 باید از Task Watchdog رسمی خود ESP-IDF استفاده کنیم.

void setupWatchdog() {
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t twdt_config = {
      .timeout_ms = WDT_TIMEOUT_SEC * 1000,
      .idle_core_mask = (1 << portNUM_PROCESSORS) - 1,
      .trigger_panic = true
    };
    esp_task_wdt_init(&twdt_config);
  #else
    esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
  #endif
  esp_task_wdt_add(NULL);
}

