sargoliwork101-ui/cooler_app14050504/esp32_api/Cooler_ESP32_WROOM_API.ino
  sc = tsc; tos = ttos; seq = tseq;
  return true;
}

// بارگذاری آخرین آمار معتبر سوییچ/مدت‌کارکرد رله، بدون توجه به دلیل ریست شدن برد
void loadRelayStats() {
  unsigned long sc0, tos0, seq0;
  unsigned long sc1, tos1, seq1;

  bool ok0 = readRelayStatFile(RELAY_STAT_FILES[0], sc0, tos0, seq0);
  bool ok1 = readRelayStatFile(RELAY_STAT_FILES[1], sc1, tos1, seq1);

  bool useSlot0 = false, useSlot1 = false;

  if (ok0 && ok1) {
    if (seq1 >= seq0) useSlot1 = true; else useSlot0 = true;
  } else if (ok0) {
    useSlot0 = true;
  } else if (ok1) {
    useSlot1 = true;
  }

  if (useSlot0) {
    relaySwitchCount = sc0; relayTotalOnSeconds = tos0;
    relayStatFileSlot = 0; relayStatSaveSeq = seq0;
  } else if (useSlot1) {
    relaySwitchCount = sc1; relayTotalOnSeconds = tos1;
    relayStatFileSlot = 1; relayStatSaveSeq = seq1;
  } else {
    // هیچ رکورد معتبری پیدا نشد (اولین راه‌اندازی برد یا خرابی کامل هر دو فایل)
    relaySwitchCount = 0;
    relayTotalOnSeconds = 0;
  }
}

// اتصال اختیاری برد به مودم/روتر برای گرفتن ساعت از اینترنت
// نکته: این اتصال باعث خاموش شدن Access Point برد نمی‌شود؛ گوشی همچنان می‌تواند مستقیم به خود برد وصل شود.
void setStaConnectionState(bool on) {
  if (on) {
    staCurrentlyOn = true;
    staCycleLastToggleMillis = millis();
    connectToInternetWiFi();
  } else {
    WiFi.setAutoReconnect(false); // در فاز خاموش چرخه، اجازهٔ اتصال خودکار مجدد داده نمی‌شود
    WiFi.disconnect(false);
    staCurrentlyOn = false;
    staCycleLastToggleMillis = millis();
    staEverConnectedThisBoot = false; // فاز بعدیِ روشن یک تلاش تازه محسوب می‌شود
  }
}

// مدیریت چرخهٔ دوره‌ای اتصال مودم اینترنت (STA).
// اگر مدت خاموش بودن صفر باشد، اتصال دائماً روشن می‌ماند و اصلاً وارد فاز خاموش نمی‌شود.
void manageStaCycle() {
  if (!internet_enabled || strlen(sta_ssid) == 0) {
    // وقتی اینترنت از پنل خاموش است یا مشخصات مودم وارد نشده، خودِ STA هم بی‌دلیل روشن نگه داشته نمی‌شود.
    if (staCurrentlyOn || WiFi.status() == WL_CONNECTED) {
      WiFi.setAutoReconnect(false);
      WiFi.disconnect(false);
      staCurrentlyOn = false;
    }
    staCycleLastToggleMillis = millis();
    return;
  }

  if (staOffMinutes == 0) {
    // حالت دائماً روشن: اگر قبلاً به‌خاطر چرخه خاموش شده بود، همین حالا دوباره وصل شود.
    if (!staCurrentlyOn) setStaConnectionState(true);
    return;
  }

  unsigned long onMs  = (unsigned long)staOnMinutes  * 60000UL;
  unsigned long offMs = (unsigned long)staOffMinutes * 60000UL;
  unsigned long elapsed = millis() - staCycleLastToggleMillis;

  if (staCurrentlyOn && elapsed >= onMs) {
    setStaConnectionState(false);
  } else if (!staCurrentlyOn && elapsed >= offMs) {
    setStaConnectionState(true);
  }
}

// اتصال اختیاری برد به مودم/روتر برای گرفتن ساعت از اینترنت
// نکته: این اتصال باعث خاموش شدن Access Point برد نمی‌شود؛ گوشی همچنان می‌تواند مستقیم به خود برد وصل شود.
void connectToInternetWiFi() {
  if (!internet_enabled) {
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(false); // اینترنت غیرفعال است؛ فقط AP برقرار می‌ماند
    return;
  }
  if (strlen(sta_ssid) == 0) {
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(false); // اگر وای‌فای اینترنت تنظیم نشده، فقط بخش STA را آزاد کن و AP باقی می‌ماند
    return;
  }

  WiFi.setAutoReconnect(true);
  Serial.print("Connecting STA to modem WiFi: ");
  Serial.println(sta_ssid);

  if (strlen(sta_password) > 0) {
    WiFi.begin(sta_ssid, sta_password);
  } else {
    WiFi.begin(sta_ssid); // پشتیبانی از شبکه‌های بدون رمز در صورت نیاز
  }

  // تنظیم ساعت با اولویت سرورهای داخلی ایران و سپس سرور جهانی
  configTime(NTP_GMT_OFFSET_SEC, 0, "ir.pool.ntp.org", "ntp.nic.ir", "pool.ntp.org");

  // نکته مهم: WiFi.begin() در هسته آردوینوی ESP32 می‌تواند به‌صورت داخلی تنظیم قدرت سیگنال رادیو را
  // به مقدار پیش‌فرض (حداکثر) بازنشانی کند. برای همین بلافاصله بعد از هر تلاش اتصال STA، سطح
  // انتخاب‌شده‌ی کاربر دوباره روی رادیو اعمال می‌شود تا تنظیم «قدرت سیگنال» واقعاً پابرجا بماند.
  applyApTxPower();
}

// تلاش دوره‌ای و غیرمسدودکننده برای دریافت ساعت از اینترنت
void tryNtpSync() {
  // نکته مهم: اینجا از ntp_synced_this_boot استفاده می‌شود، نه time_synchronized.
  // time_synchronized ممکن است از فایل ذخیره‌شده (سنکرون قبلی با گوشی یا بوت قبلی) از همان لحظه بوت true باشد؛
  // اگر آن را ملاک فاصله‌ی تلاش قرار می‌دادیم، برد فکر می‌کرد NTP قبلاً موفق بوده و به‌جای هر ۱ دقیقه
  // هر ۱ ساعت یک‌بار تلاش می‌کرد — یعنی با اینکه به مودم وصل است، ممکن بود تا یک ساعت ساعت واقعی نگیرد.
  unsigned long interval = ntp_synced_this_boot ? NTP_RECHECK_INTERVAL_MS : NTP_RETRY_INTERVAL_MS;

  if (!internet_enabled) return;
  if (!staCurrentlyOn) return;
  if (strlen(sta_ssid) == 0) return;

  if (ntpFirstCheckPending) {
    // اولین بار بعد از این بوت یا بعد از تغییر تنظیمات مودم: فارغ از فاصله‌ی زمانی، همین الان تلاش کن
    ntpFirstCheckPending = false;
  } else if (millis() - lastNtpCheckMillis < interval) {
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    // تا وقتی واقعاً به مودم وصل نشده‌ایم، زمان آخرین تلاش را جلو نمی‌بریم تا
    // به محض برقراری اتصال، گرفتن ساعت بدون انتظار اضافه انجام شود.
    return;
  }

  lastNtpCheckMillis = millis();

  time_t now = time(nullptr);
  struct tm *tmInfo = localtime(&now);

  // اگر سال معتبر بود یعنی NTP زمان واقعی داده است.
  if (tmInfo && (tmInfo->tm_year + 1900) >= 2024) {
    currentHour = tmInfo->tm_hour;
    currentMinute = tmInfo->tm_min;
    currentSecond = tmInfo->tm_sec;
    currentYear = tmInfo->tm_year + 1900;
    currentMonth = tmInfo->tm_mon + 1;
    currentDay = tmInfo->tm_mday;
    currentWeekday = (tmInfo->tm_wday + 1) % 7;
    lastTick = millis();

    if (!ntp_synced_this_boot) {
      Serial.println("Time synchronized by internet NTP.");
    }

    time_synchronized = true;
    ntp_synced_this_boot = true;
    ntpEverSucceeded = true;
    ntpLastSuccessYear = currentYear;
    ntpLastSuccessMonth = currentMonth;
    ntpLastSuccessDay = currentDay;
    ntpLastSuccessHour = currentHour;
    ntpLastSuccessMinute = currentMinute;
    ntpLastSuccessSecond = currentSecond;
    ntpLastSuccessValid = true;
    saveTimeSetting();     // ساعت اینترنتی معتبر را ذخیره کن تا در قطعی برق کوتاه از دست نرود
    saveNtpSuccessInfo();  // فقط آخرین دریافت موفق NTP ذخیره می‌شود، نه تلاش‌های ناموفق
  }
}

void handleApiRoot() {
  StaticJsonDocument<768> doc;
  doc["status"] = "success";
  doc["program"] = PROGRAM_NAME;
  doc["tagline"] = PROGRAM_TAGLINE;
  doc["api"] = "Smart Cooler REST JSON API";
  doc["version"] = STORAGE_FORMAT_REVISION;
  JsonArray endpoints = doc.createNestedArray("endpoints");
  endpoints.add("GET /status");
  endpoints.add("GET /settings");
  endpoints.add("POST /save");
  endpoints.add("POST /sync");
  endpoints.add("POST /toggle-manual");
  endpoints.add("POST /save-ap");
  endpoints.add("POST /save-sta");
  endpoints.add("POST /save-protection");
  endpoints.add("POST /save-ap-cycle");
  endpoints.add("POST /factory-reset");
  String out;
  serializeJson(doc, out);
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(200, "application/json", out);
}

void handleGetSettings() {
  DynamicJsonDocument doc(8192);
  doc["status"] = "success";
  doc["programName"] = PROGRAM_NAME;
  doc["programTagline"] = PROGRAM_TAGLINE;
  doc["maxScenarios"] = MAX_SCENARIOS;

  JsonObject ap = doc.createNestedObject("ap");
  ap["ssid"] = custom_ssid;
  ap["password"] = custom_password;
  ap["cycleEnabled"] = apCycleEnabled;
  ap["onMinutes"] = apOnMinutes;
  ap["offMinutes"] = apOffMinutes;
  ap["txPowerLevel"] = apTxPowerLevel;

  JsonObject sta = doc.createNestedObject("sta");
  sta["internetEnabled"] = internet_enabled;
  sta["ssid"] = sta_ssid;
  sta["password"] = sta_password;
  sta["onMinutes"] = staOnMinutes;
  sta["offMinutes"] = staOffMinutes;

  JsonObject protection = doc.createNestedObject("protection");
  protection["minOffMinutes"] = antiShortCycleMinutes;

